---
kind: property
id: P:Autodesk.Revit.DB.Family.StructuralFamilyNameKey
zh: 族
source: html/ae168be8-b154-fad1-72f4-6133d17ca74d.htm
---
# Autodesk.Revit.DB.Family.StructuralFamilyNameKey Property

**中文**: 族

The family's structural section shape name key.

## Syntax (C#)
```csharp
public string StructuralFamilyNameKey { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null